package main.java.constant;

import java.util.Map;

public interface AppConstants {
    int SIDE_X = 3;
    int SIDE_Y = 3;

    Map<String, Integer> ROW_INDEX = Map.ofEntries(
            Map.entry("Волк", 0),
            Map.entry("Удав", 1),
            Map.entry("Лиса", 2),
            Map.entry("Медведь", 3),
            Map.entry("Орел", 4),
            Map.entry("Лошадь", 5),
            Map.entry("Олень", 6),
            Map.entry("Кролик", 7),
            Map.entry("Мышь", 8),
            Map.entry("Коза", 9),
            Map.entry("Овца", 10),
            Map.entry("Кабан", 11),
            Map.entry("Буйвол", 12),
            Map.entry("Утка", 13),
            Map.entry("Гусеница", 14)
    );

    Map<String, Integer> COL_INDEX = Map.ofEntries(
            Map.entry("Волк", 0),
            Map.entry("Удав", 1),
            Map.entry("Лиса", 2),
            Map.entry("Медведь", 3),
            Map.entry("Орел", 4),
            Map.entry("Лошадь", 5),
            Map.entry("Олень", 6),
            Map.entry("Кролик", 7),
            Map.entry("Мышь", 8),
            Map.entry("Коза", 9),
            Map.entry("Овца", 10),
            Map.entry("Кабан", 11),
            Map.entry("Буйвол", 12),
            Map.entry("Утка", 13),
            Map.entry("Гусеница", 14),
            Map.entry("Растения", 15)
    );

    int[][] MATRIX_OF_CHANCE_EATING = new int[][]{
            {0, 0, 0, 0, 0, 10, 15, 60, 80, 60, 70, 15, 10, 40, 0, 0},  //Волк
            {0, 0, 15, 0, 0, 0, 0, 20, 40, 0, 0, 0, 0, 10, 0, 0},       //Удав
            {0, 0, 0, 0, 0, 0, 0, 70, 90, 0, 0, 0, 0, 60, 40, 0},       //Лиса
            {0, 80, 0, 0, 0, 40, 80, 80, 90, 70, 70, 50, 20, 10, 0, 0}, //Медведь
            {0, 0, 10, 0, 0, 0, 0, 90, 90, 0, 0, 0, 0, 80, 0, 0},       //Орел
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Лошадь
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Олень
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Кролик
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 90, 100},        //Мышь
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Коза
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Овца
            {0, 0, 0, 0, 0, 0, 0, 0, 50, 0, 0, 0, 0, 0, 90, 100},       //Кабан
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Буйвол
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 90, 100},        //Утка
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 100},         //Гусеница
    };
}
